app/controllers/podcasts_controller.rb

  def index
    @podcasts = Podcast.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)
---
SELECT  "podcasts".* FROM "podcasts"  ORDER BY created_at DESC LIMIT 5 OFFSET 0

  def find_episode
    @episodes = Episode.where(podcast_id: @podcast).order("created_at DESC").paginate(:page => params[:page], :per_page => 5)
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."podcast_id" = 1  ORDER BY created_at DESC LIMIT 5 OFFSET 0

  def find_podcast
    if params[:id].nil?
    @podcast = current_podcast
  else
    @podcast = Podcast.find(params[:id])
---
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ?  ORDER BY "podcasts"."id" ASC LIMIT 1  [["id", 1]]